Kolodieiev/perfect_console/firmware/hardware_tests/src/meow/driver/graphics/TFT_eSPI/Processors/TFT_eSPI_ESP32.inc
#include <Arduino.h>

#ifdef CONFIG_IDF_TARGET_ESP32

#include "../TFT_eSPI.h"
#include "./TFT_eSPI_ESP32.h"

#if !defined(TFT_PARALLEL_8_BIT)
SPIClass spi;
uint8_t SPI_BUS_NUM{HSPI};
#endif

#ifdef ESP32_DMA
// DMA SPA handle
spi_device_handle_t dmaHAL;
#ifdef CONFIG_IDF_TARGET_ESP32
#define DMA_CHANNEL 1
#ifdef USE_HSPI_PORT
spi_host_device_t spi_host = HSPI_HOST;
#elif defined(USE_FSPI_PORT)
spi_host_device_t spi_host = SPI_HOST;
#else // use VSPI port
spi_host_device_t spi_host = VSPI_HOST;
#endif
#else
#ifdef USE_HSPI_PORT
#define DMA_CHANNEL SPI_DMA_CH_AUTO
spi_host_device_t spi_host = (spi_host_device_t)SPI3_HOST; // Draws once then freezes
#else // use FSPI port
#define DMA_CHANNEL SPI_DMA_CH_AUTO
spi_host_device_t spi_host = (spi_host_device_t)SPI2_HOST; // Draws once then freezes
#endif
#endif
#endif

#if !defined(TFT_PARALLEL_8_BIT)
// Volatile for register reads:
volatile uint32_t *_spi_cmd = (volatile uint32_t *)(SPI_CMD_REG(SPI_PORT));
volatile uint32_t *_spi_user = (volatile uint32_t *)(SPI_USER_REG(SPI_PORT));
// Register writes only:
volatile uint32_t *_spi_mosi_dlen = (volatile uint32_t *)(SPI_MOSI_DLEN_REG(SPI_PORT));
volatile uint32_t *_spi_w = (volatile uint32_t *)(SPI_W0_REG(SPI_PORT));
#endif

////////////////////////////////////////////////////////////////////////////////////////
#if defined(TFT_SDA_READ) && !defined(TFT_PARALLEL_8_BIT)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           beginSDA - VSPI port only, FPSI port only for S2
** Description:             Detach MOSI and attach MISO to SDA for reads
***************************************************************************************/
void TFT_eSPI::begin_SDA_Read(void)
{
  gpio_set_direction((gpio_num_t)TFT_MOSI, GPIO_MODE_INPUT);
#ifdef CONFIG_IDF_TARGET_ESP32
  pinMatrixInAttach(TFT_MOSI, VSPIQ_IN_IDX, false);
#else // S2
  pinMatrixInAttach(TFT_MOSI, FSPIQ_IN_IDX, false);
#endif
  SET_BUS_READ_MODE;
}

/***************************************************************************************
** Function name:           endSDA - VSPI port only, FPSI port only for S2
** Description:             Attach MOSI to SDA and detach MISO for writes
***************************************************************************************/
void TFT_eSPI::end_SDA_Read(void)
{
  gpio_set_direction((gpio_num_t)TFT_MOSI, GPIO_MODE_OUTPUT);
#ifdef CONFIG_IDF_TARGET_ESP32
  pinMatrixOutAttach(TFT_MOSI, VSPID_OUT_IDX, false, false);
#else // S2
  pinMatrixOutAttach(TFT_MOSI, FSPID_OUT_IDX, false, false);
#endif
  SET_BUS_WRITE_MODE;
}

////////////////////////////////////////////////////////////////////////////////////////
#endif // #if defined (TFT_SDA_READ)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           read byte  - supports class functions
** Description:             Read a byte from ESP32 8 bit data port
***************************************************************************************/
// Parallel bus MUST be set to input before calling this function!
uint8_t TFT_eSPI::readByte(void)
{
  uint8_t b = 0xAA;

#if defined(TFT_PARALLEL_8_BIT)
  RD_L;
  uint32_t reg;           // Read all GPIO pins 0-31
  reg = gpio_input_get(); // Read three times to allow for bus access time
  reg = gpio_input_get();
  reg = gpio_input_get(); // Data should be stable now
  RD_H;

  // Check GPIO bits used and build value
  b = (((reg >> TFT_D0) & 1) << 0);
  b |= (((reg >> TFT_D1) & 1) << 1);
  b |= (((reg >> TFT_D2) & 1) << 2);
  b |= (((reg >> TFT_D3) & 1) << 3);
  b |= (((reg >> TFT_D4) & 1) << 4);
  b |= (((reg >> TFT_D5) & 1) << 5);
  b |= (((reg >> TFT_D6) & 1) << 6);
  b |= (((reg >> TFT_D7) & 1) << 7);
#endif

  return b;
}

////////////////////////////////////////////////////////////////////////////////////////
#ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set parallel bus to INPUT or OUTPUT
***************************************************************************************/
void TFT_eSPI::busDir(uint32_t mask, uint8_t mode)
{
  // Arduino generic native function
  pinMode(TFT_D0, mode);
  pinMode(TFT_D1, mode);
  pinMode(TFT_D2, mode);
  pinMode(TFT_D3, mode);
  pinMode(TFT_D4, mode);
  pinMode(TFT_D5, mode);
  pinMode(TFT_D6, mode);
  pinMode(TFT_D7, mode);
}

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set ESP32 GPIO pin to input or output (set high) ASAP
***************************************************************************************/
void TFT_eSPI::gpioMode(uint8_t gpio, uint8_t mode)
{
  pinMode(gpio, mode);
  digitalWrite(gpio, HIGH);
}
////////////////////////////////////////////////////////////////////////////////////////
#endif // #ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////
#if defined(RPI_WRITE_STROBE) && !defined(TFT_PARALLEL_8_BIT) // Code for RPi TFT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32 or ESP8266 RPi TFT
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len)
{
  uint8_t colorBin[] = {(uint8_t)(color >> 8), (uint8_t)color};
  if (len)
    spi.writePattern(&colorBin[0], 2, 1);
  len--;
  while (len--)
  {
    WR_L;
    WR_H;
  }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 or ESP8266 RPi TFT
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len)
{
  uint8_t *data = (uint8_t *)data_in;

