Kolodieiev/perfect_console/firmware/hardware_tests/src/meow/driver/graphics/TFT_eSPI/Processors/TFT_eSPI_ESP32.inc
  if (_swapBytes)
  {
    while (len--)
    {
      tft_Write_16(*data);
      data++;
    }
    return;
  }

  while (len >= 64)
  {
    spi.writePattern(data, 64, 1);
    data += 64;
    len -= 64;
  }
  if (len)
    spi.writePattern(data, len, 1);
}

////////////////////////////////////////////////////////////////////////////////////////
#elif !defined(SPI_18BIT_DRIVER) && !defined(TFT_PARALLEL_8_BIT) // Most SPI displays
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
/*
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len){

  uint32_t color32 = (color<<8 | color >>8)<<16 | (color<<8 | color >>8);
  bool empty = true;
  volatile uint32_t* spi_w = (volatile uint32_t*)_spi_w;
  if (len > 31)
  {
    *_spi_mosi_dlen =  511;
    spi_w[0]  = color32;
    spi_w[1]  = color32;
    spi_w[2]  = color32;
    spi_w[3]  = color32;
    spi_w[4]  = color32;
    spi_w[5]  = color32;
    spi_w[6]  = color32;
    spi_w[7]  = color32;
    spi_w[8]  = color32;
    spi_w[9]  = color32;
    spi_w[10] = color32;
    spi_w[11] = color32;
    spi_w[12] = color32;
    spi_w[13] = color32;
    spi_w[14] = color32;
    spi_w[15] = color32;
    while(len>31)
    {
      while ((*_spi_cmd)&SPI_USR);
      *_spi_cmd = SPI_USR;
      len -= 32;
    }
    empty = false;
  }

  if (len)
  {
    if(empty) {
      for (uint32_t i=0; i <= len; i+=2) *spi_w++ = color32;
    }
    len = (len << 4) - 1;
    while (*_spi_cmd&SPI_USR);
    *_spi_mosi_dlen = len;
    *_spi_cmd = SPI_USR;
  }
  while ((*_spi_cmd)&SPI_USR); // Move to later in code to use transmit time usefully?
}
//*/
//*
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len)
{

  volatile uint32_t *spi_w = _spi_w;
  uint32_t color32 = (color << 8 | color >> 8) << 16 | (color << 8 | color >> 8);
  uint32_t i = 0;
  uint32_t rem = len & 0x1F;
  len = len - rem;

  // Start with partial buffer pixels
  if (rem)
  {
    while (*_spi_cmd & SPI_USR)
      ;
    for (i = 0; i < rem; i += 2)
      *spi_w++ = color32;
    *_spi_mosi_dlen = (rem << 4) - 1;
    *_spi_cmd = SPI_USR;
    if (!len)
      return; //{while (*_spi_cmd&SPI_USR); return; }
    i = i >> 1;
    while (i++ < 16)
      *spi_w++ = color32;
  }

  while (*_spi_cmd & SPI_USR)
    ;
  if (!rem)
    while (i++ < 16)
      *spi_w++ = color32;
  *_spi_mosi_dlen = 511;

  // End with full buffer to maximise useful time for downstream code
  while (len)
  {
    while (*_spi_cmd & SPI_USR)
      ;
    *_spi_cmd = SPI_USR;
    len -= 32;
  }

  // Do not wait here
  // while (*_spi_cmd&SPI_USR);
}
//*/
/***************************************************************************************
** Function name:           pushSwapBytePixels - for ESP32
** Description:             Write a sequence of pixels with swapped bytes
***************************************************************************************/
void TFT_eSPI::pushSwapBytePixels(const void *data_in, uint32_t len)
{

  uint8_t *data = (uint8_t *)data_in;
  uint32_t color[16];

  if (len > 31)
  {
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
    while (len > 31)
    {
      uint32_t i = 0;
      while (i < 16)
      {
        color[i++] = DAT8TO32(data);
        data += 4;
      }
      while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
        ;
      WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
      WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
      WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
      WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
      WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
      WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
      WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
      WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
      WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), color[8]);
      WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), color[9]);
      WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color[10]);
      WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color[11]);
      WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color[12]);
      WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color[13]);
      WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color[14]);
      WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color[15]);
      SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      len -= 32;
    }
  }

  if (len > 15)
  {
    uint32_t i = 0;
    while (i < 8)
    {
      color[i++] = DAT8TO32(data);
      data += 4;
    }
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
      ;
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 255);
    WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
    WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
    WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
    WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
    WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
    WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
    WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
    WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
    len -= 16;
  }

  if (len)
  {
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
      ;
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
    for (uint32_t i = 0; i <= (len << 1); i += 4)
    {
      WRITE_PERI_REG(SPI_W0_REG(SPI_PORT) + i, DAT8TO32(data));
      data += 4;
    }
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
  }
  while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
    ;
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len)
{

