Kolodieiev/perfect_console/firmware/hardware_tests/src/meow/driver/graphics/TFT_eSPI/Processors/TFT_eSPI_ESP32.inc
  if (spiBusyCheck)
    dmaWait(); // In case we did not wait earlier

  setAddrWindow(x, y, dw, dh);

  esp_err_t ret;
  static spi_transaction_t trans;

  memset(&trans, 0, sizeof(spi_transaction_t));

  trans.user = (void *)1;
  trans.tx_buffer = buffer; // finally send the line data
  trans.length = len * 16;  // Data length, in bits
  trans.flags = 0;          // SPI_TRANS_USE_TXDATA flag

  ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
  assert(ret == ESP_OK);

  spiBusyCheck++;
}

////////////////////////////////////////////////////////////////////////////////////////
// Processor specific DMA initialisation
////////////////////////////////////////////////////////////////////////////////////////

// The DMA functions here work with SPI only (not parallel)
/***************************************************************************************
** Function name:           dc_callback
** Description:             Toggles DC line during transaction
***************************************************************************************/
extern "C" void dc_callback();

void IRAM_ATTR dc_callback(spi_transaction_t *spi_tx)
{
  if ((bool)spi_tx->user)
  {
    DC_D;
  }
  else
  {
    DC_C;
  }
}

/***************************************************************************************
** Function name:           dma_end_callback
** Description:             Clear DMA run flag to stop retransmission loop
***************************************************************************************/
extern "C" void dma_end_callback();

void IRAM_ATTR dma_end_callback(spi_transaction_t *spi_tx)
{
  WRITE_PERI_REG(SPI_DMA_CONF_REG(spi_host), 0);
}

/***************************************************************************************
** Function name:           initDMA
** Description:             Initialise the DMA engine - returns true if init OK
***************************************************************************************/
bool TFT_eSPI::initDMA(bool ctrl_cs)
{
  if (DMA_Enabled)
    return false;

  esp_err_t ret;
  spi_bus_config_t buscfg = {
      .mosi_io_num = TFT_MOSI,
      .miso_io_num = TFT_MISO,
      .sclk_io_num = TFT_SCLK,
      .quadwp_io_num = -1,
      .quadhd_io_num = -1,
#ifdef CONFIG_IDF_TARGET_ESP32S2
      .data4_io_num = -1,
      .data5_io_num = -1,
      .data6_io_num = -1,
      .data7_io_num = -1,
#endif
      .max_transfer_sz = TFT_WIDTH * TFT_HEIGHT * 2 + 8, // TFT screen size
      .flags = 0,
      .intr_flags = 0};

  int8_t pin = -1;
  if (ctrl_cs)
    pin = TFT_CS;

  spi_device_interface_config_t devcfg = {
      .command_bits = 0,
      .address_bits = 0,
      .dummy_bits = 0,
      .mode = TFT_SPI_MODE,
      .duty_cycle_pos = 0,
      .cs_ena_pretrans = 0,
      .cs_ena_posttrans = 0,
      .clock_speed_hz = SPI_FREQUENCY,
      .input_delay_ns = 0,
      .spics_io_num = pin,
      .flags = SPI_DEVICE_NO_DUMMY, // 0,
      .queue_size = 1,
      .pre_cb = 0, // dc_callback, //Callback to handle D/C line
#ifdef CONFIG_IDF_TARGET_ESP32
      .post_cb = 0
#else
      .post_cb = dma_end_callback
#endif
  };
  ret = spi_bus_initialize(spi_host, &buscfg, DMA_CHANNEL);
  ESP_ERROR_CHECK(ret);
  ret = spi_bus_add_device(spi_host, &devcfg, &dmaHAL);
  ESP_ERROR_CHECK(ret);

  DMA_Enabled = true;
  spiBusyCheck = 0;
  return true;
}

/***************************************************************************************
** Function name:           deInitDMA
** Description:             Disconnect the DMA engine from SPI
***************************************************************************************/
void TFT_eSPI::deInitDMA(void)
{
  if (!DMA_Enabled)
    return;
  spi_bus_remove_device(dmaHAL);
  spi_bus_free(spi_host);
  DMA_Enabled = false;
}

////////////////////////////////////////////////////////////////////////////////////////
#endif // End of DMA FUNCTIONS
////////////////////////////////////////////////////////////////////////////////////////

#endif //CONFIG_IDF_TARGET_ESP32
